#include<stdio.h>

int main()
{
    /*
        指针运算：
                步长：指针移动一次，走了多少字节
                char:1
                short:2
                int:4
                long:4
                long long:8
                加法：指针往后移动了n步 p+1
                减法：指针往后移动了n步 p-1

    */
   //定义变量
    int a=10;
    int *p=&a;
    printf("%p\n",p);
    printf("%p\n",p-1);
    printf("%p\n",p-2);


    /*
        指针运算有意义的操作：
            1.指针和整数进行加减操作（每次移动n个步长）
            2.指针和指针进行减操作（间隔步长）

        指针运算无意义的操作：
            3.指针和整数进行乘除操作（每次移动n个步长）
            4.指针和指针进行加乘除操作
    */
    
    //1.
    //前提条件：保证内存空间是连续的
    //数组
    int arr[]={1,2,3,4,5,6,7,8,9,10};

    //获取0索引的内存地址
    int *p1=&arr[0];

    //通过内存地址（指针p)获取数据
    printf("%d\n",*p1);
    printf("%d\n",*(p1+1));
    
    //2.
    //获取5索引的内存地址
    int *p2=&arr[5];

    //p2-p1 间隔了多少步长
    printf("%d\n",p2-p1);  //字节：5*4=20
    printf("%p\n",p1);
    printf("%p\n",p2);
    
    return 0;
}